defaulted to basic ansii diagram
